import { Injectable } from '@angular/core';
import { Product } from './product.model';

@Injectable({
  providedIn: 'root'
})
export class CommonserviceService {

  constructor() { }


  public GetProducts(){
    const products: Product[] = [
      new Product('Alabama', 'Alabama', 'Sofas', 'Alabama', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Alexa', 'Alexa', 'Sofas', 'Alexa', 3, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Arkansas', 'Arkansas', 'Sofas', 'Arkansas', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Arriet', 'Arriet', 'Sofas', 'Arriet', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Bruno', 'Bruno', 'Sofas', 'Bruno', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Cloud', 'Cloud', 'Sofas', 'Cloud', 7, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Falconi', 'Falconi', 'Sofas', 'Falconi', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Florida', 'Florida', 'Sofas', 'Florida', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Galisia', 'Galisia', 'Sofas', 'Galisia', 7, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Georgia', 'Georgia', 'Sofas', 'Georgia', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Hamilton', 'Hamilton', 'Sofas', 'Hamilton', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Hermes', 'Hermes', 'Sofas', 'Hermes', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Icon', 'Icon', 'Sofas', 'Icon', 7, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Jordan', 'Jordan', 'Sofas', 'Jordan', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Kordoba', 'Kordoba', 'Sofas', 'Kordoba', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Kortina', 'Kortina', 'Sofas', 'Kortina', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Leon', 'Leon', 'Sofas', 'Leon', 6, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Lima', 'Lima', 'Sofas', 'Lima', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Livorno', 'Livorno', 'Sofas', 'Livorno', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Moka', 'Moka', 'Sofas', 'Moka', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Monaco', 'Monaco', 'Sofas', 'Monaco', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Morgan', 'Morgan', 'Sofas', 'Morgan', 6, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Mundo', 'Mundo', 'Sofas', 'Mundo', 3, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Nevada', 'Nevada', 'Sofas', 'Nevada', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('New Jersey', 'New Jersey', 'Sofas', 'New-Jersey', 6, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Nik', 'Nik', 'Sofas', 'Nik', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Odineze', 'Odineze', 'Sofas', 'Odineze', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Olivenza', 'Olivenza', 'Sofas', 'Olivenza', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Palensia', 'Palensia', 'Sofas', 'Palensia', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Porto Venere', 'Porto Venere', 'Sofas', 'Porto-Venere', 3, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Saragosa', 'Saragosa', 'Sofas', 'Saragosa', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Simone', 'Simone', 'Sofas', 'Simone', 5, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Sunset', 'Sunset', 'Sofas', 'Sunset', 6, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Texas', 'Texas', 'Sofas', 'Texas', 8, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Tiffany', 'Tiffany', 'Sofas', 'Tiffany', 3, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Verona', 'Verona', 'Sofas', 'Verona', 4, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Vigo Nuovo', 'Vigo Nuovo', 'Sofas', 'Vigo-Nuovo', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('Vigo', 'Vigo', 'Sofas', 'Vigo', 2, 'Луксозен ръчно изработен диван с първокласни материали, предлагащ несравним комфорт и изискан дизайн. Перфектен за стилни интериори.'),
      new Product('101L', '101L', 'Armchair', '101l', 6, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('506B', '506B', 'Armchair', '506b', 7, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('507T', '507T', 'Armchair', '507t', 5, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('Galaxy', 'Galaxy', 'Armchair', 'galaxy', 6, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('Avezano', 'Avezano', 'Armchair', 'avezano', 6, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('Kiss', 'Kiss', 'Armchair', 'kiss', 4, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('Palacio', 'Palacio', 'Armchair', 'palacio', 4, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('Clio', 'Clio', 'Armchair', 'clio', 7, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('Tokyo', 'Tokyo', 'Armchair', 'tokyo', 4, 'Ръчно изработен фотьойл с ергономичен дизайн и първокласни материали. Комбинира стил и комфорт за изискани пространства.'),
      new Product('303M', '303M', 'Tables', '303m', 3, 'Уникална дизайнерска маса, съчетаваща стил и функционалност. Изработена с внимание към детайла и устойчивостта.'),
      new Product('304M', '304M', 'Tables', '304m', 3, 'Уникална дизайнерска маса, съчетаваща стил и функционалност. Изработена с внимание към детайла и устойчивостта.'),
      new Product('405M', '405M', 'Tables', '405m', 4, 'Уникална дизайнерска маса, съчетаваща стил и функционалност. Изработена с внимание към детайла и устойчивостта.'),
      new Product('406M', '406M', 'Tables', '406m', 3, 'Уникална дизайнерска маса, съчетаваща стил и функционалност. Изработена с внимание към детайла и устойчивостта.'),
      new Product('Aksinia', 'Aksinia', 'Beds', 'aksinia', 4, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Amore', 'Amore', 'Beds', 'amore', 6, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Belinda', 'Belinda', 'Beds', 'belinda', 3, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Izabel', 'Izabel', 'Beds', 'izabel', 4, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Lotos', 'Lotos', 'Beds', 'lotos', 5, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Lu', 'Lu', 'Beds', 'lu', 3, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Lusia', 'Lusia', 'Beds', 'lusia', 3, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Nikol', 'Nikol', 'Beds', 'nikol', 4, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Sunrise', 'Sunrise', 'Beds', 'sunrise', 5, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Amore', 'Amore', 'Beds', 'amore', 6, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Belinda', 'Belinda', 'Beds', 'belinda', 3, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Izabel', 'Izabel', 'Beds', 'izabel', 4, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Lotos', 'Lotos', 'Beds', 'lotos', 5, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Lu', 'Lu', 'Beds', 'lu', 3, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Lusia', 'Lusia', 'Beds', 'lusia', 3, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Nikol', 'Nikol', 'Beds', 'nikol', 4, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('Sunrise', 'Sunrise', 'Beds', 'sunrise', 5, 'Елегантно и удобно легло с висококачествена тапицерия. Ръчно изработено за съвършен баланс между комфорт и стил.'),
      new Product('1306s', '1306s', 'Chairs', '1306s', 4, 'Луксозен ръчно изработен стол с ергономичен дизайн. Осигурява комфорт и стил за всяко пространство.'),
      new Product('1319s', '1319s', 'Chairs', '1319s', 5, 'Луксозен ръчно изработен стол с ергономичен дизайн. Осигурява комфорт и стил за всяко пространство.'),
      new Product('1321s', '1321s', 'Chairs', '1321s', 3, 'Луксозен ръчно изработен стол с ергономичен дизайн. Осигурява комфорт и стил за всяко пространство.'),
      new Product('1327s', '1327s', 'Chairs', '1327s', 4, 'Луксозен ръчно изработен стол с ергономичен дизайн. Осигурява комфорт и стил за всяко пространство.'),
      new Product('1329s', '1329s', 'Chairs', '1329s', 4, 'Луксозен ръчно изработен стол с ергономичен дизайн. Осигурява комфорт и стил за всяко пространство.'),
      new Product('1329b', '1329b', 'Chairs', '1329b', 4, 'Луксозен ръчно изработен стол с ергономичен дизайн. Осигурява комфорт и стил за всяко пространство.')
  ];

    return products
  }
}
